app/views/articles/index.html.erb

              <div class="card-footer text-body-secondary">
                <small>Create <%= time_ago_in_words(article.created_at) %> ago,
                edited <%= time_ago_in_words(article.updated_at) %> ago</small>
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "another boring shit"], ["description", "jajajajajajaja"], ["created_at", "2023-12-05 19:17:52.572266"], ["updated_at", "2023-12-05 19:17:52.572266"]]