app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    #debugger
    @article = Article.find(params[:id])

SELECT "articles".* FROM "articles"
---
  def index
    #debugger
    @articles = Article.all

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "soy un guevo!"], ["description", "definivamente soy un guevo y debería estar en la NASA!"], ["created_at", "2023-12-07 19:40:33.283806"], ["updated_at", "2023-12-07 19:40:33.283806"]]
---
  def create
    @article = Article.new(params.require(:article).permit(:title, :description))

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "third article - edited"], ["description", "description edited"], ["updated_at", "2023-12-07 17:59:28.182935"], ["id", 3]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(params.require(:article).permit(:title, :description))