app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = User.first #pending to remove this, this is for testing purposes
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]