app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "slugolugo"], ["email", "slugolugo@example.com"], ["created_at", "2023-12-21 18:33:30.580454"], ["updated_at", "2023-12-21 18:33:30.580454"], ["password_digest", "[FILTERED]"]]

  def update
    #@user = User.find(params[:id])
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "auser@adomainloco.com"], ["updated_at", "2023-12-21 20:14:34.151008"], ["id", 11]]